In [1]:
import pandas as pd
import numpy as np

In [18]:
df=pd.DataFrame(np.arange(16).reshape(4,4),index=['NK','PK','DK','MK'],columns=['A','B','C','D'])

In [19]:
df

     A   B   C   D
NK   0   1   2   3
PK   4   5   6   7
DK   8   9  10  11
MK  12  13  14  15

In [20]:
df.index=df.index.map(str.lower)

In [21]:
df

     A   B   C   D
nk   0   1   2   3
pk   4   5   6   7
dk   8   9  10  11
mk  12  13  14  15

In [27]:
df.rename(index=str.upper,columns=str.lower,inplace=True)

In [28]:
df.rename({'nk':'sk'})

     a   b   c   d
NK   0   1   2   3
PK   4   5   6   7
DK   8   9  10  11
MK  12  13  14  15